app/Http/Controllers/Member/CrawlerItemsController.php

select * from `crawler_items` where `is_active` = '1' limit 5 offset 15
select count(*) as aggregate from `crawler_items` where `is_active` is null
---
    public function index()
    {
        $crawlerTask = $this->crawlerService->crawlerTaskRepo->getById(request()->crawlerTask);
        $crawlerItems = $crawlerTask->crawlerItems()
            ->where('is_active', request()->is_active)
            ->paginate(5);

update `crawler_items` set `is_active` = 0, `crawler_items`.`updated_at` = '2020-03-07 00:18:39' where `ci_id` = 4
---
    public function toggle(Request $request){
        $crawlerItem = $this->crawlerService->crawlerItemRepo->getById($request->ci_id);
        if($crawlerItem->is_active==1){
            $crawlerItem->is_active=0;
        }else{
            $crawlerItem->is_active=1;
        }
        $crawlerItem->save();