app/Services/Member/CrawlerTaskService.php

update `crawler_tasks` set `is_active` = 1, `crawler_tasks`.`updated_at` = '2020-03-06 20:52:12' where `ct_id` = 1
---
    public function update($model,$data)
    {
        $crawlerTask = $model;
        return $crawlerTask->update($data);