app/Models/CrawlerItemSKU.php

select * from `citem_sku_details` where `citem_sku_details`.`modelid` = '2476889505' and `citem_sku_details`.`modelid` is not null and `shopid` = '14073158' and `itemid` = '2476889505' order by `created_at` asc limit 7
---
    public function CrawlerItemSKUDetails_7records()
    {
        return $this->hasMany(CrawlerItemSKUDetail::class, 'modelid', 'modelid')
            ->where('shopid', $this->shopid)
            ->where('itemid', $this->itemid)
            ->take(7);