app/Http/Controllers/Admin/AdminsController.php

update `admins` set `name` = 'adminxx', `birthday` = '2020-02-14 00:42:23', `admins`.`updated_at` = '2020-02-14 00:42:23' where `id` = 1
---
    public function update(AdminRequest $request,  ImageUploadHandler $uploader,Admin $admin)
    {
        $this->authorize('update', $admin);
        $data = $request->all();
        if($request->avatar) {
            $result = $uploader->save($request->avatar, 'avatars', $admin->id, 416);